# Introduction to pandas 
 importing pandas

In [4]:
import pandas as pd

In [5]:
#Make a Series

series =pd.Series(["car","gas","hello","jiu"])

In [12]:
series

0      car
1      gas
2    hello
3      jiu
dtype: object

In [13]:
colors =pd.Series(["blue","green","red","white"])

In [14]:
colors

0     blue
1    green
2      red
3    white
dtype: object

In [27]:
#making a dataframe

df= pd.DataFrame({"series": 1, "cloes":[1,2,3]})

In [25]:
df

   series  cloes
0       1      1
1       1      2
2       1      3

# importing a csv file as dataframe

In [29]:
df=pd.read_csv("car-sales.csv")

In [37]:
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [53]:
df.to_csv("car_sales_dow.csv",index =False)

In [57]:
df1 = pd.read_csv("car_sales_dow.csv")

In [58]:
df1

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Some Basic function and attributes applied on data

In [65]:
# Describe function calculate basic math function
df1.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [66]:
#dtypes tell us each coloum type
df1.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [68]:
#mean tell us mean of each numeric  coloum type
df1.mean()

C:\Users\Barcha\AppData\Local\Temp\ipykernel_6984\3092488973.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [78]:
#coloums give us name of coloum
coloums = df1.columns
coloums[0:]

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [79]:
#index give us how many rows are there
df1.index

RangeIndex(start=0, stop=10, step=1)

In [80]:
#info give us i
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [81]:
df1.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [83]:
df1.median()

C:\Users\Barcha\AppData\Local\Temp\ipykernel_6984\2279417019.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.median()

Odometer (KM)    57369.0
Doors                4.0
dtype: float64

In [91]:
df1['Make'].

10

In [92]:


df1

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00